app/Controllers/Admin/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['users'] = $this->userModel->findAll();

INSERT INTO `users` (`name`, `email`, `password`, `role`, `irban_unit`, `created_at`, `updated_at`) VALUES ('Operator Irban 2', 'irban2@inspektorat.katingan.go.id', '$2y$12$SkXyS6FjeLbhNXOZV./1LuVuPztmi/7sfUkMJwu6FtQIw.53X3XEq', 'operator', 'irban2', '2026-01-29 14:06:05', '2026-01-29 14:06:05')
---
    public function create()
    {
        $rules = [
            'name' => 'required',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[5]',
            'role' => 'required',
            'irban_unit' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'status' => 'error',
                'messages' => $this->validator->getErrors()
            ]);
        }

        $data = [
            'name' => $this->request->getVar('name'),
            'email' => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'role' => $this->request->getVar('role'),
            'irban_unit' => $this->request->getVar('irban_unit'),
        ];

        $this->userModel->insert($data);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function edit($id = null)
    {
        $data['user'] = $this->userModel->find($id);