app/Controllers/Auth.php

    public function loginAction()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'irban1@inspektorat.katingan.go.id'
 LIMIT 1