app/Controllers/PublicPage.php

    public function index()
    {
        // Ambil data yang dipublish saja
        $data['programs'] = $this->pkptModel
            ->where('is_published', 1)
            ->orderBy('tgl_mulai', 'DESC')
            ->findAll();
---
SELECT *
FROM `pkpt_programs`
WHERE `is_published` = 1
ORDER BY `tgl_mulai` DESC

    public function widget()
    {
        // Widget khusus menampilkan yang sedang berjalan (ON PROGRESS) atau sesuai request
        // Default: Tampilkan semua yang publish, tappi layout minimalis

        $data['programs'] = $this->pkptModel
            ->where('is_published', 1)
            ->where('status !=', 'batal') // Contoh filter
            ->orderBy('tgl_mulai', 'DESC')
            ->findAll(10); // Limit 10 untuk widget
---
SELECT *
FROM `pkpt_programs`
WHERE `is_published` = 1
AND `status` != 'batal'
ORDER BY `tgl_mulai` DESC
 LIMIT 10